Repository: BakasaRus/BooksCatalog
Catalog: translations/validators.*.xlf
Languages: ru

# validators.author.exists
source: This author already exists in catalog
ru: Автор с такими данными уже существует

# validators.author.name
source: Name cannot be empty
ru: Введите имя

# validators.author.surname
source: Surname cannot be empty
ru: Введите фамилию

# validators.author.midname
source: Middle name cannot be empty
ru: Введите отчество

# validators.book.exists_isbn
source: Book with this ISBN already exists
ru: Книга с таким ISBN уже существует

# validators.book.exists_title_pub
source: Book with this title and year of publication already exists
ru: Книга с таким названием и годом выпуска уже существует

# validators.book.title
source: Title cannot be empty
ru: Введите название книги

# validators.book.pub_year
source: Year of publication cannot be empty
ru: Введите год публикации

# validators.book.isbn
source: ISBN cannot be empty
ru: Введите ISBN

# validators.book.isbn_invalid
source: ISBN should be in correct format. Both ISBN-10 and ISBN-13 formats are supported
ru: Введите корректный ISBN. Поддерживаются как ISBN-10, так и ISBN-13

# validators.book.pages
source: Count of pages cannot be empty
ru: Введите количество страниц

# validators.book.cover_formats
source: Cover should be in JPEG or PNG format
ru: Обложка должна быть в формате JPEG или PNG
